// for (let number = 1; number <= 100; number++) {
//   if (number % 2 !== 0) {
//     continue;
//                                                        четные и нечетные
//   console.log(number);
// }

//1. создайте переменную а и запустите цикл до 100 когда n%2 ==0,
// прибавить значение цикла на a//
// let a = 0;
// for (let n = 1; n <= 100; n++) {
//   if (n % 2 == 0) {
//     a += n;
//   }
// }
// console.log(a);

//2. Создайте переменную b=10; и запустите цикл до 50, когда значение цикла будет равен b, выйдите из цикла.

// let b = 10;
// for (let q = 1; q <= 50; q++) {
//   if (q == b) {
//     break;
//   }
//   console.log(q);
// }

// //3. создайте переменную с=30; запустите цикл до 100  и пропускайте пока значение цикла не будет равен с;

// let c = 30;
// for (let s = 1; s <= 50; s++) {
//   if (s !== c) {
//     continue;
//   }

//   console.log(s);
// }

////////////////////////////////////// lengths ///////////////////////////////////////////////////////////////////

//1.найдите количество а в тексте при помощи цикла.

//2. узнайте в какой позиции находится символ "w".
// let text = "This is a hard work!!!";
// for (let i = 0; i < text.length; i++) {
//   if (text.charAt(i) === "w") {
//     console.log(i + 1);
//   }
// }

//3. заменить пробелы в тексте на F;

// let text = "This is a hard work!!!";
// for (let i = 0; i < text.length; i++) {
//   if (text.charAt(i) === " ") {
//     console.log(text[text.charAt(i)] + "f");
//   }
// }
